C9Adrian/CPE403/Final/CCS/sensor_cc1350lp/sensor_cc1350lp/configPkg/package/cfg/app_pem3.c
/* Object__count__C */
#pragma DATA_SECTION(xdc_runtime_Gate_Object__count__C, ".const:xdc_runtime_Gate_Object__count__C");
__FAR__ const CT__xdc_runtime_Gate_Object__count xdc_runtime_Gate_Object__count__C = 0;

/* Object__heap__C */
#pragma DATA_SECTION(xdc_runtime_Gate_Object__heap__C, ".const:xdc_runtime_Gate_Object__heap__C");
__FAR__ const CT__xdc_runtime_Gate_Object__heap xdc_runtime_Gate_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma DATA_SECTION(xdc_runtime_Gate_Object__sizeof__C, ".const:xdc_runtime_Gate_Object__sizeof__C");
__FAR__ const CT__xdc_runtime_Gate_Object__sizeof xdc_runtime_Gate_Object__sizeof__C = 0;

/* Object__table__C */
#pragma DATA_SECTION(xdc_runtime_Gate_Object__table__C, ".const:xdc_runtime_Gate_Object__table__C");
__FAR__ const CT__xdc_runtime_Gate_Object__table xdc_runtime_Gate_Object__table__C = 0;


/*
 * ======== xdc.runtime.HeapMin INITIALIZERS ========
 */

/* Object__DESC__C */
__FAR__ const xdc_runtime_Core_ObjDesc xdc_runtime_HeapMin_Object__DESC__C;

/* Object__PARAMS__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Object__PARAMS__C, ".const:xdc_runtime_HeapMin_Object__PARAMS__C");
__FAR__ const xdc_runtime_HeapMin_Params xdc_runtime_HeapMin_Object__PARAMS__C = {
    sizeof (xdc_runtime_HeapMin_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&xdc_runtime_HeapMin_Object__PARAMS__C.__iprms, /* instance */
    ((xdc_Ptr)(0x0)),  /* buf */
    ((xdc_UArg)(0x0)),  /* size */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
xdc_runtime_HeapMin_Module__ xdc_runtime_HeapMin_Module__root__V = {
    {&xdc_runtime_HeapMin_Module__root__V.link,  /* link.next */
    &xdc_runtime_HeapMin_Module__root__V.link},  /* link.prev */
};

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__diagsEnabled__C, ".const:xdc_runtime_HeapMin_Module__diagsEnabled__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__diagsEnabled xdc_runtime_HeapMin_Module__diagsEnabled__C = (xdc_Bits32)0x10;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__diagsIncluded__C, ".const:xdc_runtime_HeapMin_Module__diagsIncluded__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__diagsIncluded xdc_runtime_HeapMin_Module__diagsIncluded__C = (xdc_Bits32)0x10;

/* Module__diagsMask__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__diagsMask__C, ".const:xdc_runtime_HeapMin_Module__diagsMask__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__diagsMask xdc_runtime_HeapMin_Module__diagsMask__C = ((CT__xdc_runtime_HeapMin_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__gateObj__C, ".const:xdc_runtime_HeapMin_Module__gateObj__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__gateObj xdc_runtime_HeapMin_Module__gateObj__C = ((CT__xdc_runtime_HeapMin_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__gatePrms__C, ".const:xdc_runtime_HeapMin_Module__gatePrms__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__gatePrms xdc_runtime_HeapMin_Module__gatePrms__C = ((CT__xdc_runtime_HeapMin_Module__gatePrms)0);

/* Module__id__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__id__C, ".const:xdc_runtime_HeapMin_Module__id__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__id xdc_runtime_HeapMin_Module__id__C = (xdc_Bits16)0xa;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerDefined__C, ".const:xdc_runtime_HeapMin_Module__loggerDefined__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerDefined xdc_runtime_HeapMin_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerObj__C, ".const:xdc_runtime_HeapMin_Module__loggerObj__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerObj xdc_runtime_HeapMin_Module__loggerObj__C = ((CT__xdc_runtime_HeapMin_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerFxn0__C, ".const:xdc_runtime_HeapMin_Module__loggerFxn0__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerFxn0 xdc_runtime_HeapMin_Module__loggerFxn0__C = ((CT__xdc_runtime_HeapMin_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerFxn1__C, ".const:xdc_runtime_HeapMin_Module__loggerFxn1__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerFxn1 xdc_runtime_HeapMin_Module__loggerFxn1__C = ((CT__xdc_runtime_HeapMin_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerFxn2__C, ".const:xdc_runtime_HeapMin_Module__loggerFxn2__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerFxn2 xdc_runtime_HeapMin_Module__loggerFxn2__C = ((CT__xdc_runtime_HeapMin_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerFxn4__C, ".const:xdc_runtime_HeapMin_Module__loggerFxn4__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerFxn4 xdc_runtime_HeapMin_Module__loggerFxn4__C = ((CT__xdc_runtime_HeapMin_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Module__loggerFxn8__C, ".const:xdc_runtime_HeapMin_Module__loggerFxn8__C");
__FAR__ const CT__xdc_runtime_HeapMin_Module__loggerFxn8 xdc_runtime_HeapMin_Module__loggerFxn8__C = ((CT__xdc_runtime_HeapMin_Module__loggerFxn8)0);

/* Object__count__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Object__count__C, ".const:xdc_runtime_HeapMin_Object__count__C");
__FAR__ const CT__xdc_runtime_HeapMin_Object__count xdc_runtime_HeapMin_Object__count__C = 0;

/* Object__heap__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Object__heap__C, ".const:xdc_runtime_HeapMin_Object__heap__C");
__FAR__ const CT__xdc_runtime_HeapMin_Object__heap xdc_runtime_HeapMin_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma DATA_SECTION(xdc_runtime_HeapMin_Object__sizeof__C, ".const:xdc_runtime_HeapMin_Object__sizeof__C");
__FAR__ const CT__xdc_runtime_HeapMin_Object__sizeof xdc_runtime_HeapMin_Object__sizeof__C = sizeof(xdc_runtime_HeapMin_Object__);

