C9Adrian/CPE403/Final/CCS/sensor_cc1350lp/sensor_cc1350lp/configPkg/package/cfg/app_pem3.c
/*
 * ======== xdc.runtime.Defaults SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool xdc_runtime_Defaults_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== xdc.runtime.Diags SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool xdc_runtime_Diags_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== xdc.runtime.Gate SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool xdc_runtime_Gate_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== xdc.runtime.HeapMin SYSTEM FUNCTIONS ========
 */

/* per-module runtime symbols */
#undef Module__MID
#ifdef xdc_runtime_HeapMin_Module__id__CR
#define Module__MID (*((CT__xdc_runtime_HeapMin_Module__id *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__id__C_offset)))
#else
#define Module__MID xdc_runtime_HeapMin_Module__id__C
#endif

#undef Module__DGSINCL
#ifdef xdc_runtime_HeapMin_Module__diagsIncluded__CR
#define Module__DGSINCL (*((CT__xdc_runtime_HeapMin_Module__diagsIncluded *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__diagsIncluded__C_offset)))
#else
#define Module__DGSINCL xdc_runtime_HeapMin_Module__diagsIncluded__C
#endif

#undef Module__DGSENAB
#ifdef xdc_runtime_HeapMin_Module__diagsEnabled__CR
#define Module__DGSENAB (*((CT__xdc_runtime_HeapMin_Module__diagsEnabled *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__diagsEnabled__C_offset)))
#else
#define Module__DGSENAB xdc_runtime_HeapMin_Module__diagsEnabled__C
#endif

#undef Module__DGSMASK
#ifdef xdc_runtime_HeapMin_Module__diagsMask__CR
#define Module__DGSMASK (*((CT__xdc_runtime_HeapMin_Module__diagsMask *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__diagsMask__C_offset)))
#else
#define Module__DGSMASK xdc_runtime_HeapMin_Module__diagsMask__C
#endif

#undef Module__LOGDEF
#ifdef xdc_runtime_HeapMin_Module__loggerDefined__CR
#define Module__LOGDEF (*((CT__xdc_runtime_HeapMin_Module__loggerDefined *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerDefined__C_offset)))
#else
#define Module__LOGDEF xdc_runtime_HeapMin_Module__loggerDefined__C
#endif

#undef Module__LOGOBJ
#ifdef xdc_runtime_HeapMin_Module__loggerObj__CR
#define Module__LOGOBJ xdc_runtime_HeapMin_Module__loggerObj__R
#define Module__LOGOBJ (*((CT__xdc_runtime_HeapMin_Module__loggerObj *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerObj__C_offset)))
#else
#define Module__LOGOBJ xdc_runtime_HeapMin_Module__loggerObj__C
#endif

#undef Module__LOGFXN0
#ifdef xdc_runtime_HeapMin_Module__loggerFxn0__CR
#define Module__LOGFXN0 (*((CT__xdc_runtime_HeapMin_Module__loggerFxn0 *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerFxn0__C_offset)))
#else
#define Module__LOGFXN0 xdc_runtime_HeapMin_Module__loggerFxn0__C
#endif

#undef Module__LOGFXN1
#ifdef xdc_runtime_HeapMin_Module__loggerFxn1__CR
#define Module__LOGFXN1 (*((CT__xdc_runtime_HeapMin_Module__loggerFxn1 *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerFxn1__C_offset)))
#else
#define Module__LOGFXN1 xdc_runtime_HeapMin_Module__loggerFxn1__C
#endif

#undef Module__LOGFXN2
#ifdef xdc_runtime_HeapMin_Module__loggerFxn2__CR
#define Module__LOGFXN2 (*((CT__xdc_runtime_HeapMin_Module__loggerFxn2 *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerFxn2__C_offset)))
#else
#define Module__LOGFXN2 xdc_runtime_HeapMin_Module__loggerFxn2__C
#endif

#undef Module__LOGFXN4
#ifdef xdc_runtime_HeapMin_Module__loggerFxn4__CR
#define Module__LOGFXN4 (*((CT__xdc_runtime_HeapMin_Module__loggerFxn4 *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerFxn4__C_offset)))
#else
#define Module__LOGFXN4 xdc_runtime_HeapMin_Module__loggerFxn4__C
#endif

#undef Module__LOGFXN8
#ifdef xdc_runtime_HeapMin_Module__loggerFxn8__CR
#define Module__LOGFXN8 (*((CT__xdc_runtime_HeapMin_Module__loggerFxn8 *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__loggerFxn8__C_offset)))
#else
#define Module__LOGFXN8 xdc_runtime_HeapMin_Module__loggerFxn8__C
#endif

#undef Module__G_OBJ
#ifdef xdc_runtime_HeapMin_Module__gateObj__CR
#define Module__G_OBJ (*((CT__xdc_runtime_HeapMin_Module__gateObj *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__gateObj__C_offset)))
#else
#define Module__G_OBJ xdc_runtime_HeapMin_Module__gateObj__C
#endif

#undef Module__G_PRMS
#ifdef xdc_runtime_HeapMin_Module__gatePrms__CR
#define Module__G_PRMS (*((CT__xdc_runtime_HeapMin_Module__gatePrms *)(xdcRomConstPtr + xdc_runtime_HeapMin_Module__gatePrms__C_offset)))
#else
#define Module__G_PRMS xdc_runtime_HeapMin_Module__gatePrms__C
#endif

#undef Module__GP_create
#define Module__GP_create xdc_runtime_HeapMin_Module_GateProxy_create
#undef Module__GP_delete
#define Module__GP_delete xdc_runtime_HeapMin_Module_GateProxy_delete
#undef Module__GP_enter
#define Module__GP_enter xdc_runtime_HeapMin_Module_GateProxy_enter
#undef Module__GP_leave
#define Module__GP_leave xdc_runtime_HeapMin_Module_GateProxy_leave
#undef Module__GP_query
#define Module__GP_query xdc_runtime_HeapMin_Module_GateProxy_query

/* Module__startupDone__S */
xdc_Bool xdc_runtime_HeapMin_Module__startupDone__S( void )
{
    return 1;
}

/* Handle__label__S */
xdc_runtime_Types_Label *xdc_runtime_HeapMin_Handle__label__S(xdc_Ptr obj, xdc_runtime_Types_Label *lab) 
{
    lab->handle = obj;
    lab->modId = 10;
    xdc_runtime_Core_assignLabel(lab, 0, 0);

    return lab;
}

/* Params__init__S */
xdc_Void xdc_runtime_HeapMin_Params__init__S( xdc_Ptr prms, const void *src, xdc_SizeT psz, xdc_SizeT isz ) 
{
    xdc_runtime_Core_assignParams__I(prms, (xdc_CPtr)(src ? src : &xdc_runtime_HeapMin_Object__PARAMS__C), psz, isz);
}

/* Object__get__S */
xdc_Ptr xdc_runtime_HeapMin_Object__get__S(xdc_Ptr oa, xdc_Int i)
{
    if (oa) {
        return ((xdc_runtime_HeapMin_Object__ *)oa) + i;
    }

    return NULL;
}


/* Object__first__S */
xdc_Ptr xdc_runtime_HeapMin_Object__first__S( void ) 
{
    xdc_runtime_Types_InstHdr *iHdr = (xdc_runtime_Types_InstHdr *)xdc_runtime_HeapMin_Module__root__V.link.next;

    if (iHdr != (xdc_runtime_Types_InstHdr *)&xdc_runtime_HeapMin_Module__root__V.link) {
        return iHdr + 1;
    }
    else {
        return NULL;
    }
}

/* Object__next__S */
xdc_Ptr xdc_runtime_HeapMin_Object__next__S( xdc_Ptr obj )
{
    xdc_runtime_Types_InstHdr *iHdr = ((xdc_runtime_Types_InstHdr *)obj) - 1;

    if (iHdr->link.next != (xdc_runtime_Types_Link *)&xdc_runtime_HeapMin_Module__root__V.link) {
        return (xdc_runtime_Types_InstHdr *)(iHdr->link.next) + 1;
    }
    else {
        return NULL;
    }
}

/* Object__create__S */
xdc_Ptr xdc_runtime_HeapMin_Object__create__S (
    xdc_CPtr __aa,
    const xdc_UChar *__paramsPtr,
    xdc_SizeT __psz,
    xdc_runtime_Error_Block *eb)
{
    xdc_runtime_HeapMin_Params __prms;
    xdc_runtime_HeapMin_Object *__obj;

    /* common instance initialization */
    __obj = xdc_runtime_Core_createObject__I(&xdc_runtime_HeapMin_Object__DESC__C, NULL, &__prms, (xdc_CPtr)__paramsPtr, 0, eb);
    if (__obj == NULL) {
        return NULL;
    }


    /* module-specific initialization */
    xdc_runtime_HeapMin_Instance_init__E(__obj, &__prms);
    return __obj;
}

/* create */
xdc_runtime_HeapMin_Handle xdc_runtime_HeapMin_create( const xdc_runtime_HeapMin_Params *__paramsPtr, xdc_runtime_Error_Block *eb )
{
    xdc_runtime_HeapMin_Params prms;
    xdc_runtime_HeapMin_Object *obj;


    /* common instance initialization */
    obj = xdc_runtime_Core_createObject__I(&xdc_runtime_HeapMin_Object__DESC__C, NULL, &prms, (xdc_CPtr)__paramsPtr, 0, eb);
    if (obj == NULL) {
        return NULL;
    }

    /* module-specific initialization */
    xdc_runtime_HeapMin_Instance_init__E(obj, &prms);
    return obj;
}

/* construct */
void xdc_runtime_HeapMin_construct(xdc_runtime_HeapMin_Struct *__obj, const xdc_runtime_HeapMin_Params *__paramsPtr )
{
    xdc_runtime_HeapMin_Params __prms;

    /* common instance initialization */
    xdc_runtime_Core_constructObject__I(&xdc_runtime_HeapMin_Object__DESC__C, __obj, &__prms, (xdc_CPtr)__paramsPtr, 0, NULL);

    /* module-specific initialization */
    xdc_runtime_HeapMin_Instance_init__E((xdc_Ptr)__obj, &__prms);
}

/* destruct */
void xdc_runtime_HeapMin_destruct(xdc_runtime_HeapMin_Struct *obj)
{
    xdc_runtime_Core_deleteObject__I(&xdc_runtime_HeapMin_Object__DESC__C, obj, NULL, -1, TRUE);
}

